app/controllers/api/v1/artists_controller.rb

      def show
        @artist = Artist.find(params["id"])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]

      def index
        @artists = Artist.page(params[:page].to_i || 1)
        render json: { artists: @artists.map{ |artist| artist.to_json }, page: @artists.current_page, total_pages: @artists.total_pages }
---
SELECT  "artists".* FROM "artists" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "artists"

      def create
        @artist = Artist.create(artist_params)
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "as"], ["created_at", "2021-01-30 16:56:49.155997"], ["updated_at", "2021-01-30 16:56:49.155997"]]

      def update
        @artist = Artist.find(params["id"])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]

      def destroy
        @artist = Artist.find(params["id"])
        not_found unless @artist
        @artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 78]]