app/controllers/api/v1/concerts_controller.rb

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
---
      def show
        @concert = Concert.find(params["id"])

SELECT  "concerts".* FROM "concerts" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "concerts"
---
      def index
        @concerts = Concert.page(params[:page].to_i || 1)
        render json: { concerts: @concerts.map{ |concert| concert.to_json }, page: @concerts.current_page, total_pages: @concerts.total_pages }

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "concerts" SET "updated_at" = $1, "locality_id" = $2 WHERE "concerts"."id" = $3  [["updated_at", "2021-01-30 16:33:25.001160"], ["locality_id", 4], ["id", 2]]
---
      def update
        @concert = Concert.find(params["id"])
        @concert.update(concert_params)

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "concerts" WHERE "concerts"."id" = $1  [["id", 2]]
---
      def destroy
        @concert = Concert.find(params["id"])
        @concert.destroy