app/controllers/api/v1/localities_controller.rb

SELECT  "localities".* FROM "localities" WHERE "localities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        @locality = Locality.find(params["id"])

SELECT  "localities".* FROM "localities" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "localities"
---
      def index
        @localities = Locality.page(params[:page].to_i || 1)

INSERT INTO "localities" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dummy"], ["address", "dummy address"], ["created_at", "2021-01-30 16:48:03.358615"], ["updated_at", "2021-01-30 16:48:03.358615"]]
---
      def create
        @locality = Locality.create(locality_params)

SELECT  "localities".* FROM "localities" WHERE "localities"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
---
      def update
        @locality = Locality.find(params["id"])

SELECT  "localities".* FROM "localities" WHERE "localities"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
DELETE FROM "localities" WHERE "localities"."id" = $1  [["id", 83]]
---
      def destroy
        @locality = Locality.find(params["id"])
        not_found unless @locality
        @locality.destroy